/* The default title for FUIAttachmentsFormCell.\n This string can be overwritten by the \"attachmentsTItle\" property \n in FUIAttachmentsFormCell. */
"AttachmentsFormatKey" = "Attachments (%d)";

/* Old singular title format */
"AttachmentsKey" = "Attachment (%d)";

/* The action list title when \"add attachment\" button is tapped. */
"AddAttachmentKey" = "Add Attachment";

/* The string for taking a photo in add attachment action list. */
"TakePhotoKey" = "Take Photo";

/* The string for choosing a photo from the photo library in add attachment action list. */
"PhotoLibraryKey" = "Photo Library";

/* The voice announcement when an attachment is deleted */
"AttachmentDeletedKey" = "Attachment %d deleted";

/* The string for selecting a file from the document picker in add attachment action list. */
"FilesKey" = "Files";

/* The string for canceling adding an attachment in add attahment action list. */
"CancelKey" = "Cancel";

/* The default placeholder text for FUITitleFormCell.\n App can use the \"placeholderText\" property of FUITitleFormCell to override this string. */
"TitleKey" = "Title";

/* The default placeholder text for FUINoteFormCell.\n App can use the \"placeholderText\" property of FUINoteFormCell to override this string. */
"NotesKey" = "Notes";

/* The default placeholder text for value field of FUISimplePropertyFormCell.\n App can use the \"placeholderText\" property of FUISimplePropertyFormCell to override this string. */
"ValueKey" = "Value";

/* The warning string when there is no navigationController for the current\n UITableViewController for the FUIFormCell. */
"NoNavigationCtlWarningKey" = "WARNING: The navigationController for the current UITableViewController for FUIFormCell is nil. FUIAttachmentsFormCell and ListPickerFormCell will not work properly.";

/* The format string for valueTextField of DurationPckerFormCell.\n This string can be overwritten by the \"durationFormatString\" property\n in FUIDurationPickerFormCell. */
"DurationKey" = "%d Hrs %d Min";

/* The default keyName for the `FUIDurationPickerFormCell`. */
"Duration" = "Duration";

/* The hour label string in the FUIDurationPickerFormCell */
"hourKey" = "hour";

/* The hours label string in the FUIDurationPickerFormCell */
"hoursKey" = "hours";

/* The minute label string in the FUIDurationPickerFormCell */
"minKey" = "min";

/* The section header title for selected entries in ListPickerFormCell. */
"SelectedKey" = "Selected";

/* The section header title for all entries in ListPickerFormCell. */
"AllKey" = "All";

/* The anchor button title for selected entries in `FUIListPickerTableViewController`. */
"SelectedFormatKey" = "Selected (%d)";

/* The anchor button accesibility hint format for multiple selected items. */
"MultipleSelectedFormatKey" = "Double tap to view the %d selected items.";

/* The anchor button accesibility hint format for single selected item. */
"SingleSelectedFormatKey" = "Double tap to view the selected item.";

/* The alert message for `FUIListPickerTableViewController` pulldown dismissal */
"DiscardSelectionsMessageKey" = "Are you sure you want to discard your selections?";

/* The alert Discard Changes action title for `FUIListPickerTableViewController` pulldown dismissal */
"DiscardChangesKey" = "Discard Changes";

/* The alert Keep Editing action title for `FUIListPickerTableViewController` pulldown dismissal */
"KeepEditingKey" = "Keep Editing";

/* The title for the Apply action title for the `FUIListPickerTableViewController` */
"ApplyKey" = "Apply";

/* The warning string when search is enabled but the `ListPickerFormCell\n` has the `listPickerDataSource` set but `listPickerSearchResultsUpdating\n` property is nil. Search is disabled in this case. */
"NoResultsUpdatingWarningKey" = "Warning: Search is disabled due to property listPickerSearchResultsUpdating in ListPickerFormCell is nil.";

/* The \"Select All\" button title on the List Picker header */
"SelectAllKey" = "Select All";

/* The \"Deselect All\" button title on the List Picker header */
"DeselectAllKey" = "Deselect All";

/* The \"Close\" button title on the Barcode Scan View */
"CloseKey" = "Close";

/* The \"More\" indicator title displayed in Object Cell when text is truncated, and may be expanded. */
"DisplayMoreKey" = "more";

/* The \"Less\" indicator title displayed in Object Cell when text is fully displayed, and may be compressed with truncation. */
"DisplayLessKey" = "Less";

/* The string for switch button */
"SwitchBUttonKey" = "Switch Button";

/* The string used in accessibility indicating switch in on. */
"SwitchOn" = "on";

/* The string used in accessibility indicating switch is off. */
"SwitchOff" = "off";

/* The string used in accessibility informing user to double tap on the switch to toggle between on and off. */
"SwitchTap" = "Double tap to toggle setting";

/* The default title for FUIOrderPickerFormCell.\n This string can be overwritten by the \"title\" property \n in FUIOrderPickerFormCell. */
"SortByKey" = "Sort by";

/* The sort criterion state for FUIOrderPickerFormItemCell.\n It is used in voice over. */
"NotSelectedKey" = "Not Selected";

/* Criterion view accessibility hint */
"CriterionHintKey" = "Double tap to toggle the selection";

/* OrderDirection view accessibility hint */
"OrderDirectionHintKey" = "Double tap to toggle the order direction";

/* FUISliderFormCell accessibility label */
"FUISliderFormCellAccessibilityLabelKey" = "this is %@ slider whose maximum value is %@ and minimum value is %@";

/* FUISliderFormCell accessibility hint */
"FUISliderFormCellAccessibilityHintKey" = "you can swipe up/down while element is selected to change value of slider";

/* FUISliderFormCell accessibility value */
"FUISliderFormCellAccessibilityValueKey" = "Current value is %@";

/* FUISliderFormCell accessibility change value */
"FUISliderFormCellAccessibilityChangeValueKey" = "Current value changed to %@";

/* Default hint text for Read-only Field for FUITextFieldFormCell */
"ReadOnlyFieldKey" = "Read-only field";

/* Default error text for when the character count reaches the maximum limit for `FUITextFieldFormCell` */
"CharCountReachLimitMsg" = "No more characters remaining";

/* Default error text for when the character count exceeds the maximum limit for `FUITextFieldFormCell`.*/
"CharCountBeyondLimitMsg" = "Reduce the number of characters";

/* Default accessibility label for Alternative Input Action button name for FUITextFieldFormCell */
"AlternativeInputActionKey" = "Alternative input action";

/* Button for accessibility voice over announcement */
"ButtonKey" = "Button";

/* Clear Text button title */
"ClearTextKey" = "Clear Text";

/* Announcement for input text is cleared */
"InputTextClearedKey" = "Input taxt cleared";

/* Other accessibility hint strings */
"DoubleTapToOpenKey" = "Double tap to open";

"DoubleTapToCollapseKey" = "Double tap to collapse";

"DoubleTapToSelectFromList" = "Double tap to select from list";

"DoubleTapToSelect" = "Double tap to select";

"DoubleTapToUnselect" = "Double tap to unselect";

"FlashKey" = "Flash";

"FlashIsTurnedOnKey" = "Flash is turned on";

"FlashIsTurnedOffKey" = "Flash is turned off";

"DoubleTapToTurnOnFlashKey" = "Double tap to turn on flash";

"DoubleTapToTurnOffFlashKey" = "Double tap to turn off flash";

/* FUIStepperView tip */
"StepperTipKey" = "This is a stepper that is editable";

/* FUIStepperView tip unable be edited */
"StepperTipNotEditableKey" = "This is a stepper that can't be edited";

/* FUIStepperView stepper maximum value */
"StepperMaximumValueKey" = "Maximum value is %@";

/* FUIStepperView stepper minimum value */
"StepperMinimumValueKey" = "Minimum value is %@";

/* FUIStepperView increase button */
"StepperIncreaseValueByOneKey" = "Increase the value by 1";

/* FUIStepperView decrease button */
"StepperDecreaseValueByOneKey" = "Decrease the value by 1";

/* FUIStepperView textField value */
"StepperCurrentValueKey" = "Current value is";

/* Title for UINavigationBar in the FUISortFilterViewController */
"Filter" = "Filter";

/* Subtitle for UINavigationBar in the FUISortFilterViewController; \"\\(filteredNum)\" and \"\\(totalNum)\" don't require localization. */
"ResultsOf" = "Results \\(filteredNum) of \\(totalNum)";

/* Title for Action Button in the FUISortFilterViewController; \"\\(filteredNum)\" doesn't require localization. */
"ShowResults" = "Show \\(filteredNum) items";

/* Title for Button \"Reset\" in UINavigationBar to reset filter criteria in the FUISortFilterViewController */
"Reset" = "Reset";

/* FUIRangeSliderContentView slider tip */
"SliderTipKey" = "This is a slider that is editable, the minimum value is %@ and the maximum value is %@";

/* FUIRangeSliderContentView slider tip unable be editable */
"SliderTipNotEditableKey" = "This is a slider that can't be edited, the minimum value is %@ and the maximum value is %@";

/* FUIRangeSliderContentView range slider tip */
"RangeSliderTipKey" = "This is a range slider that is editable, the minimum value is %@ and the maximum value is %@";

/* FUIRangeSliderContentView range slider tip unable be editable */
"RangeSliderTipNotEditableKey" = "This is a range slider that can't be edited, the minimum value is %@ and the maximum value is %@";

/* FUIRangeSliderContentView slider value textField */
"SliderValueTextFieldKey" = "slider value text field";

/* FUIRangeSliderContentView range slider lower value textField */
"RangeSliderLowerValueTextFieldKey" = "lower value text field";

/* FUIRangeSliderContentView range slider upper value textField */
"RangeSliderUpperValueTextFieldKey" = "upper value text field";

/* FUIRangeSliderContentView range slider textField hint text */
"RangeSliderTextFieldHintKey" = "You can double tap to input a specific value";

/* FUIRangeSlider slider thumb tip */
"SliderThumbTipKey" = "slider thumb, current value is";

/* FUIRangeSlider slider hint text */
"SliderThumbHintKey" = "you can swipe up or down to change the value";

/* FUIRangeSlider lower range slider thumb tip */
"LowerRangeSliderThumbTipKey" = "lower range slider thumb, current value is";

/* FUIRangeSlider lower range slider thumb hint text */
"LowerRangeSliderThumbHintKey" = "you can swipe up or down to change the lower value";

/* FUIRangeSlider upper range slider thumb tip */
"UpperRangeSliderThumbTipKey" = "upper range slider thumb, current value is";

/* FUIRangeSlider upper range slider thumb hint text */
"UpperRangeSliderThumbHintKey" = "you can swipe up or down to change the upper value";

/* FUIRangeSlider slider value tip */
"SliderValueTipKey" = "current value is %@";

/* FUIRangeSlider range slider value tip */
"RangeSliderValueTipKey" = "current lower value is %@, upper value is %@";

/* FUIRatingControl accessibility label */
"RatingControlAccessibilityLabel" = "%d out of %d stars";

/* FUIRatingControl hint */
"RatingControlHintKey" = "Double tap and drag left or right to adjust the value";

/* Search Barcode Scan Button */
"BarcodeScanKey" = "Barcode Scan";

"BarcodeScanHintKey" = "Double tap to scan";
